mfide/boun_cmu_emulator/CMUEMU/Source/p32mz0512efe100_vs.h
#ifndef __32MZ0512EFE100_H
#define __32MZ0512EFE100_H

#define KVA_TO_PA(v) 	((uint32_t)(v) & 0x1fffffff)
#define __attribute__(x)
#define __asm__(x)
#define __builtin_disable_interrupts()
#define __builtin_enable_interrupts()
#define __builtin_get_isr_state()	0
#define __builtin_set_isr_state(x)
#define __builtin_bcsc0(x,y,a,b)
#define _CP0_GET_COUNT()	0
#define	_CP0_SET_COUNT(x)
#define __ISR(a, b)
#define _CP0_CONFIG                            16
#define _CP0_CONFIG_SELECT                     0

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#define CFGCON CFGCON
extern volatile uint32_t   CFGCON __attribute__((section("sfrs"), address(0xBF800000)));
typedef union {
  struct {
    uint32_t TDOEN:1;
    uint32_t :1;
    uint32_t TROEN:1;
    uint32_t JTAGEN:1;
    uint32_t ECCCON:2;
    uint32_t :1;
    uint32_t IOANCPN:1;
    uint32_t USBSSEN:1;
    uint32_t :2;
    uint32_t PGLOCK:1;
    uint32_t PMDLOCK:1;
    uint32_t IOLOCK:1;
    uint32_t :2;
    uint32_t OCACLK:1;
    uint32_t ICACLK:1;
    uint32_t :6;
    uint32_t CPUPRI:1;
    uint32_t DMAPRI:1;
  };
  struct {
    uint32_t :7;
    uint32_t IOANCPEN:1;
  };
} __CFGCONbits_t;
extern volatile __CFGCONbits_t CFGCONbits __asm__ ("CFGCON") __attribute__((section("sfrs"), address(0xBF800000)));
#define DEVID DEVID
extern volatile uint32_t   DEVID __attribute__((section("sfrs"), address(0xBF800020)));
typedef struct {
  uint32_t DEVID:28;
  uint32_t VER:4;
} __DEVIDbits_t;
extern volatile __DEVIDbits_t DEVIDbits __asm__ ("DEVID") __attribute__((section("sfrs"), address(0xBF800020)));
#define SYSKEY SYSKEY
extern volatile uint32_t   SYSKEY __attribute__((section("sfrs"), address(0xBF800030)));
typedef struct {
  uint32_t SYSKEY:32;
} __SYSKEYbits_t;
extern volatile __SYSKEYbits_t SYSKEYbits __asm__ ("SYSKEY") __attribute__((section("sfrs"), address(0xBF800030)));
#define PMD1 PMD1
extern volatile uint32_t   PMD1 __attribute__((section("sfrs"), address(0xBF800040)));
typedef struct {
  uint32_t ADCMD:1;
  uint32_t :11;
  uint32_t CVRMD:1;
} __PMD1bits_t;
extern volatile __PMD1bits_t PMD1bits __asm__ ("PMD1") __attribute__((section("sfrs"), address(0xBF800040)));
extern volatile uint32_t        PMD1CLR __attribute__((section("sfrs"),address(0xBF800044)));
extern volatile uint32_t        PMD1SET __attribute__((section("sfrs"),address(0xBF800048)));
extern volatile uint32_t        PMD1INV __attribute__((section("sfrs"),address(0xBF80004C)));
#define PMD2 PMD2
extern volatile uint32_t   PMD2 __attribute__((section("sfrs"), address(0xBF800050)));
typedef struct {
  uint32_t CMP1MD:1;
  uint32_t CMP2MD:1;
} __PMD2bits_t;
extern volatile __PMD2bits_t PMD2bits __asm__ ("PMD2") __attribute__((section("sfrs"), address(0xBF800050)));
extern volatile uint32_t        PMD2CLR __attribute__((section("sfrs"),address(0xBF800054)));
extern volatile uint32_t        PMD2SET __attribute__((section("sfrs"),address(0xBF800058)));
extern volatile uint32_t        PMD2INV __attribute__((section("sfrs"),address(0xBF80005C)));
#define PMD3 PMD3
extern volatile uint32_t   PMD3 __attribute__((section("sfrs"), address(0xBF800060)));
typedef struct {
  uint32_t IC1MD:1;
  uint32_t IC2MD:1;
  uint32_t IC3MD:1;
  uint32_t IC4MD:1;
  uint32_t IC5MD:1;
  uint32_t IC6MD:1;
  uint32_t IC7MD:1;
  uint32_t IC8MD:1;
  uint32_t IC9MD:1;
  uint32_t :7;
  uint32_t OC1MD:1;
  uint32_t OC2MD:1;
  uint32_t OC3MD:1;
  uint32_t OC4MD:1;
  uint32_t OC5MD:1;
  uint32_t OC6MD:1;
  uint32_t OC7MD:1;
  uint32_t OC8MD:1;
  uint32_t OC9MD:1;
} __PMD3bits_t;
extern volatile __PMD3bits_t PMD3bits __asm__ ("PMD3") __attribute__((section("sfrs"), address(0xBF800060)));
extern volatile uint32_t        PMD3CLR __attribute__((section("sfrs"),address(0xBF800064)));
extern volatile uint32_t        PMD3SET __attribute__((section("sfrs"),address(0xBF800068)));
extern volatile uint32_t        PMD3INV __attribute__((section("sfrs"),address(0xBF80006C)));
#define PMD4 PMD4
extern volatile uint32_t   PMD4 __attribute__((section("sfrs"), address(0xBF800070)));
typedef struct {
  uint32_t T1MD:1;
  uint32_t T2MD:1;
  uint32_t T3MD:1;
  uint32_t T4MD:1;
  uint32_t T5MD:1;
  uint32_t T6MD:1;
  uint32_t T7MD:1;
  uint32_t T8MD:1;
  uint32_t T9MD:1;
} __PMD4bits_t;
extern volatile __PMD4bits_t PMD4bits __asm__ ("PMD4") __attribute__((section("sfrs"), address(0xBF800070)));
extern volatile uint32_t        PMD4CLR __attribute__((section("sfrs"),address(0xBF800074)));
extern volatile uint32_t        PMD4SET __attribute__((section("sfrs"),address(0xBF800078)));
extern volatile uint32_t        PMD4INV __attribute__((section("sfrs"),address(0xBF80007C)));
#define PMD5 PMD5
extern volatile uint32_t   PMD5 __attribute__((section("sfrs"), address(0xBF800080)));
typedef struct {
  uint32_t U1MD:1;
  uint32_t U2MD:1;
  uint32_t U3MD:1;
  uint32_t U4MD:1;
  uint32_t U5MD:1;
  uint32_t U6MD:1;
  uint32_t :2;
  uint32_t SPI1MD:1;
  uint32_t SPI2MD:1;
  uint32_t SPI3MD:1;
  uint32_t SPI4MD:1;
  uint32_t SPI5MD:1;
  uint32_t SPI6MD:1;
  uint32_t :2;
  uint32_t I2C1MD:1;
  uint32_t I2C2MD:1;
  uint32_t I2C3MD:1;
  uint32_t I2C4MD:1;
  uint32_t I2C5MD:1;
  uint32_t :3;
  uint32_t USBMD:1;
} __PMD5bits_t;
extern volatile __PMD5bits_t PMD5bits __asm__ ("PMD5") __attribute__((section("sfrs"), address(0xBF800080)));
extern volatile uint32_t        PMD5CLR __attribute__((section("sfrs"),address(0xBF800084)));
extern volatile uint32_t        PMD5SET __attribute__((section("sfrs"),address(0xBF800088)));
extern volatile uint32_t        PMD5INV __attribute__((section("sfrs"),address(0xBF80008C)));
#define PMD6 PMD6
extern volatile uint32_t   PMD6 __attribute__((section("sfrs"), address(0xBF800090)));
typedef struct {
  uint32_t RTCCMD:1;
  uint32_t :7;
  uint32_t REFO1MD:1;
  uint32_t REFO2MD:1;
  uint32_t REFO3MD:1;
  uint32_t REFO4MD:1;
  uint32_t :4;
  uint32_t PMPMD:1;
  uint32_t EBIMD:1;
  uint32_t :5;
  uint32_t SQI1MD:1;
  uint32_t :4;
  uint32_t ETHMD:1;
} __PMD6bits_t;
extern volatile __PMD6bits_t PMD6bits __asm__ ("PMD6") __attribute__((section("sfrs"), address(0xBF800090)));
extern volatile uint32_t        PMD6CLR __attribute__((section("sfrs"),address(0xBF800094)));
extern volatile uint32_t        PMD6SET __attribute__((section("sfrs"),address(0xBF800098)));
extern volatile uint32_t        PMD6INV __attribute__((section("sfrs"),address(0xBF80009C)));
#define PMD7 PMD7
extern volatile uint32_t   PMD7 __attribute__((section("sfrs"), address(0xBF8000A0)));
typedef struct {
  uint32_t :4;
  uint32_t DMAMD:1;
  uint32_t :15;
  uint32_t RNGMD:1;
} __PMD7bits_t;
extern volatile __PMD7bits_t PMD7bits __asm__ ("PMD7") __attribute__((section("sfrs"), address(0xBF8000A0)));
extern volatile uint32_t        PMD7CLR __attribute__((section("sfrs"),address(0xBF8000A4)));
extern volatile uint32_t        PMD7SET __attribute__((section("sfrs"),address(0xBF8000A8)));
extern volatile uint32_t        PMD7INV __attribute__((section("sfrs"),address(0xBF8000AC)));
#define CFGEBIA CFGEBIA
extern volatile uint32_t   CFGEBIA __attribute__((section("sfrs"), address(0xBF8000C0)));
typedef struct {
  uint32_t EBIA0EN:1;
  uint32_t EBIA1EN:1;
  uint32_t EBIA2EN:1;
  uint32_t EBIA3EN:1;
  uint32_t EBIA4EN:1;
  uint32_t EBIA5EN:1;
  uint32_t EBIA6EN:1;
  uint32_t EBIA7EN:1;
  uint32_t EBIA8EN:1;
  uint32_t EBIA9EN:1;
  uint32_t EBIA10EN:1;
  uint32_t EBIA11EN:1;
  uint32_t EBIA12EN:1;
  uint32_t EBIA13EN:1;
  uint32_t EBIA14EN:1;
  uint32_t EBIA15EN:1;
  uint32_t EBIA16EN:1;
  uint32_t EBIA17EN:1;
  uint32_t EBIA18EN:1;
  uint32_t EBIA19EN:1;
  uint32_t :11;
  uint32_t EBIPINEN:1;
} __CFGEBIAbits_t;
